/**********************************

* プログラミング実習

* マッチ３ゲームの作成

***********************************/

#include"DxLib.h"
#include"FreamControl.h"
#include"InputControl.h"
#include"SceneManager.h"

/**********************************

* マクロ定義

***********************************/

#define SCREEN_HEIGHT    (480)            //スクリーンサイズ(高さ)
#define SCREEN_WIDTH     (640)            //スクリーンサイズ(幅)
#define SCREEN_COLORBIT    (32)           //スクリーンカラービット
#define FONT_SIZE     (20)                //文字サイズ            


/**********************************

* 型定義

***********************************/

/**********************************

* グローバル変数定義

***********************************/

/**********************************

* プロトタイプ宣言

***********************************/

/**********************************

* プログラムの開始

***********************************/



